//Задача 26: Напишите программу, которая принимает на вход число и выдаёт количество цифр в числе.
//456 -> 3
//78 -> 2
//89126 -> 5

//Console.WriteLine("Ведите Число");
//int sumNumbers = Convert.ToInt32(Console.ReadLine())

Console.WriteLine("Введите число ");
string input = Console.ReadLine();
Console.WriteLine($"Количество цифр в строке {input.Length}"); 